app/Models/Transaksi/TransaksiModel.php

    function getTransaksi($id = null)
    {
		$builder = $this->db->table($this->table);

        if ($id) {
            $builder->where('transaksi_id', $id);
            $this->_data = $builder->get()->getRow();
---
SELECT *
FROM `tb_transaksi`
WHERE `transaksi_id` = '3'