app/Controllers/Referensi/Buku/Buku.php

                $data['updated_date'] = date('Y-m-d H:i:s');
                if ($this->validation->withRequest($this->request)->run() === TRUE )
                {
                    $this->buku->update($id, $data);
---
UPDATE `tb_buku` SET `isbn` = '979-328-808-6', `judul` = 'Buku Ajar Tumbuh Kembang Remaja & Permasalahanya', `penulis` = 'Soetjiningsih', `penerbit` = 'Sagung Seto', `tahun_terbit` = '2004', `jumlah_halaman` = '541'
WHERE `tb_buku`.`buku_id` IN ('20')