app/Models/Referensi/Buku/BukuModel.php

    function getBuku($id = null)
    {
		$builder = $this->db->table($this->table);

        if ($id) {
            $builder->where('buku_id', $id);
            $this->_data = $builder->get()->getRow();
        } else {
            $builder->orderBy('judul ASC');
            $this->_data = $builder->get()->getResult();
---
SELECT *
FROM `tb_buku`
WHERE `buku_id` = '20'
SELECT *
FROM `tb_buku`
ORDER BY `judul` ASC