app/Controllers/Transaksi/DataTransaksi.php

                $data['updated_date'] = date('Y-m-d H:i:s');
                if ($this->validation->withRequest($this->request)->run() === TRUE )
                {
                    $this->transaksi->update($id, $data);
---
UPDATE `tb_transaksi` SET `buku_id` = '6', `anggota_id` = '1', `tgl_peminjaman` = '2023-06-22', `tgl_pengembalian` = '2023-06-29', `updated_by` = 1, `updated_date` = '2023-06-22 19:56:28'
WHERE `tb_transaksi`.`transaksi_id` IN ('3')


                if ($this->validation->withRequest($this->request)->run() === TRUE  )
                    {
                        $this->transaksi->insert($data);
---
INSERT INTO `tb_transaksi` (`buku_id`, `anggota_id`, `tgl_peminjaman`, `tgl_pengembalian`, `status`, `created_by`, `created_date`) VALUES ('6', '1', '2023-06-22', '2023-06-30', 0, 1, '2023-06-22 19:55:45')

    public function upateStatus()
    {

        $id = decrypt(current_url(true)->getSegment(4));
        $status = current_url(true)->getSegment(5);

        $data = array (
            'status'    => $status,
        );

        $this->transaksi->update($id, $data);
---
UPDATE `tb_transaksi` SET `status` = '1'
WHERE `tb_transaksi`.`transaksi_id` IN ('3')