app/Models/Referensi/Anggota/AnggotaModel.php

SELECT *
FROM `tb_anggota`
ORDER BY `nama_lengkap` ASC
---
    function getAnggota($id = null)
    {
		$builder = $this->db->table($this->table);

        if ($id) {
            $builder->where('anggota_id', $id);
            $this->_data = $builder->get()->getRow();
        } else {
            $builder->orderBy('nama_lengkap ASC');
            $this->_data = $builder->get()->getResult();